# CouldNotCreateWallPartDueToWallJoin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForWallFailures..::..CouldNotCreateWallPartDueToWallJoin Property
BuiltInFailures..::..PartMakerMethodForWallFailures Class See Also
---
Failed to create basic layer geometry due to an excessively short edge created by wall join.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotCreateWallPartDueToWallJoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotCreateWallPartDueToWallJoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotCreateWallPartDueToWallJoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace